---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings
source: html/57e0c5ff-555c-7345-ac24-3592207a4d70.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings

Contains diagram settings for analysis display style element.

## Syntax (C#)
```csharp
public class AnalysisDisplayDiagramSettings : IDisposable
```